Tekla Open API Reference for Tekla Structures 2025
Drawing Class
 The Drawing class represents a drawing in Tekla Structures.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.Drawing
 Tekla.Structures.Drawing.AssemblyDrawing
 Tekla.Structures.Drawing.CastUnitDrawing
 Tekla.Structures.Drawing.GADrawing
 Tekla.Structures.Drawing.MultiDrawing
 Tekla.Structures.Drawing.SinglePartDrawing
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public abstract class Drawing : DatabaseObject
<SerializableAttribute>
Public MustInherit Class Drawing
	Inherits DatabaseObject
The Drawing type exposes the following members.
Properties
Name | Description
CommitMessage
 Gets the commit message
CreationDate
 The drawing creation date.
DrawingTypeStr
 The type of the drawing
IsFrozen
 Describes whether the drawing is frozen.
IsIssued
 Describes whether the drawing is issued.
IsIssuedButModified
 Describes whether the drawing is issued but modified since it was issued.
IsLocked
 Describes whether the drawing is locked.
IsLockedBy
 Gets the logged in username that set the drawing to locked
IsMasterDrawing
 Describes whether the drawing is a master drawing (shown with a special symbol on the drawing list).
IsReadyForIssue
 Describes whether the drawing is ready for issue.
IsReadyForIssueBy
 Gets the logged in username that set the drawing Ready for issue
IssuingDate
 The drawing issuing date.
Layout
 Gets the drawing layout attributes.
Mark
 The drawing mark.
ModificationDate
 The drawing modification date.
Name
 The name of the drawing.
OutputDate
 The drawing output date. XS_DISABLE_DRAWING_PLOT_DATE controls whether this date is set.
QueryReturnValue
 Status information about the latest database operation (select, insert, modify, delete).
 (Inherited from DatabaseObject.)
SectionViewStartLabel
 Gets the drawing attribute for start label of section view
Title1
 The first drawing title.
Title2
 The second drawing title.
Title3
 The third drawing title.
UpToDateStatus
 Gets the drawing up to date status.
Top
Methods
Name | Description
CommitChanges()
 Commits the changes made to the drawings database so far. Commit inserts a kind of save-point into the database and the save-point will be retrieved if the user does undo. Commit also executes all messages. Please note that you need to also to save the drawings database to persists the changes to disk.
CommitChanges(String)
 Commits the changes made to the drawings database so far. Commit inserts a kind of save-point into the database and the save-point will be retrieved if the user does undo. Commit also executes all messages. Please note that you need to also to save the drawings database to persists the changes to disk.
Delete
 Deletes the drawing. An active drawing cannot be deleted.
 (Overrides DatabaseObject.Delete().)
GetDoubleUserProperties(Dictionary<String, Double>)
 Retrieves all double user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetDoubleUserProperties(List<String>, Dictionary<String, Double>)
 Retrieves all double user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetIdsOfUnnumberedDrawings
 Returns the list of identifiers of those drawings in the input that are NOT up to date regarding numbering in the drawing
GetIntegerUserProperties(Dictionary<String, Int32>)
 Retrieves all integer user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetIntegerUserProperties(List<String>, Dictionary<String, Int32>)
 Retrieves all integer user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetPlotFileName
Get plot file name.
GetPlotFileNameExt
Get plot file name.
GetSheet
 Gets the sheet of the drawing.
GetStringUserProperties(Dictionary<String, String>)
 Retrieves all string user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetStringUserProperties(List<String>, Dictionary<String, String>)
 Retrieves all string user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetUserProperty(String, Double)
 Gets a double property from the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
GetUserProperty(String, Int32)
 Gets an integer property from the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
GetUserProperty(String, String)
 Gets a string property from the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
Insert
 Inserts the object instance into the database. The inserted instance must be of a real type.
 (Inherited from DatabaseObject.)
IsSameDatabaseObject
 Returns true if the current object and the given object are referencing the same database object.
 (Overrides DatabaseObject.IsSameDatabaseObject(DatabaseObject).)
Modify
 Modifies the instance in the database.
 (Inherited from DatabaseObject.)
PlaceViews
 Places views on the sheet. Computes the required size of the views to fit the parts, then places the views so that they fit on the sheet and do not overlap. Adjusts the sheet size if needed.
Select
 Selects the object instance from the database.
 (Inherited from DatabaseObject.)
SetUserProperty(String, Double)
 Sets a double property for the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
SetUserProperty(String, Int32)
 Sets an integer property for the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
SetUserProperty(String, String)
 Sets a string property for the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace